[
  {
    "name": "Sponge Cake",
    "ingredients": ["eggs", "sugar", "flour"],
    "steps": [
      "To make a sponge cake, you need 4 large eggs separated, 60 grams caster sugar, and 40 grams all-purpose flour.",
      "Preheat the oven to 350°F or 180°C.",
      "In a large bowl, add the egg yolks and half of the sugar (30 grams). Whisk together until completely combined.",
      "Sift in the flour. Whisk together until a smooth paste forms.",
      "In the bowl of a stand mixer, add egg whites and mix until egg whites turn foamy.",
      "Add in the remaining 30 grams of sugar.",
      "Continue mixing at highest speed until egg whites form stiff peaks.",
      "Add 1/3 of the egg white mixture into the cake batter. Gently fold with a spatula until no white streaks remain. Repeat with another 1/3. Repeat with remaining 1/3.",
      "Pour batter into the prepared baking pan. Bake in the oven for about 10 minutes or until a toothpick inserted comes out clean.",
      "Your cake is done. Enjoy!"
    ]
  },
  {
    "name": "Chocolate Cake",
    "ingredients": ["flour", "cocoa powder", "sugar", "milk"],
    "steps": [
      "To make a chocolate cake, you need 1 1/2 cups (187 g) self-rising flour, 1/2 cup (52 g) unsweetened cocoa powder, 1 cup (195 g) granulated white sugar, and 1 1/3 cups (10.6 oz) whole milk.",
      "Preheat the oven to 350°F or 180°C.",
      "In a large mixing bowl, add flour and cocoa powder. Whisk until evenly combined.",
      "Add in sugar and whisk until combined.",
      "Pour in milk and whisk until the batter is smooth.",
      "Pour batter into the prepared cake pan. Bake for about 30 minutes or until the cake is done and the toothpick inserted comes out clean.",
      "Your cake is done. Enjoy!"
    ]
  },
  {
    "name": "Chocolate Chip Cookies",
    "ingredients": ["butter", "sugar", "flour", "baking soda", "salt", "vanilla extract", "chocolate"],
    "steps": [
      "To make chocolate chip cookies, you need 250 g butter, 1 ½ cups sugar, 2 cups flour, 1 tea spoon baking soda, ½ tea spoon salt, 1 tea spoon vanilla extract, 2 cups chocolate chips.",
      "You’re going to start by melting the butter. The butter shouldn’t be sizzling hot.Once the butter has melted, whisk in the sugars until well-combined.",
      "Mix in the vanilla extract and the egg.",
      "Add the flour, baking soda, and salt. Stir in just until combined. You don’t want to overmix the dough.",
      "Stir in the chocolate chips, and then scoop the dough. Place about 2 inches apart on the prepared baking sheet.",
      "Bake until the cookies are set on the edges but slightly underdone in the middle, about 7-10 minutes. Slightly under-baking the cookies helps to keep them soft.",
      "Your cookies are done. Enjoy!"
    ]
  },
  {
    "name": "Banana Cake",
    "ingredients": ["banana", "flour", "butter", "baking powder", "sugar"],
    "steps": [
      "To make a banana cake, you need 2 bananas, 1 cup of all-purpose flour, 100g of unsalted butter, 1 teaspoon of baking powder, and ½ cup of sugar.",
      "Preheat oven to 175°C or 350°F. Grease a small cake tin.",
      "Mash bananas in a bowl until smooth.",
      "Cream butter and sugar together until light and fluffy.",
      "Add mashed bananas to the butter-sugar mixture and mix well.",
      "Sift flour and baking powder together, then fold into the wet mixture.",
      "Pour batter into the greased tin and smooth the top.",
      "Bake for 25–30 minutes or until a toothpick comes out clean.",
      "Cool, slice, and enjoy!"
    ]
  },
  {
    "name": "Carrot Cake",
    "ingredients": ["flour", "baking soda", "sugar", "oil", "salt", "cinnamon", "vanilla extract", "eggs", "carrot"],
    "steps": [
      "To make a carrot cake, you need 1 ½ cups flour, 1 teaspoon baking soda, 1 ¼ cups sugar, ½ cup oil, 1 teaspoon salt, 1 teaspoon cinnamon powder, 1 teaspoon vanilla extract, 2 eggs, 1 cup carrots, and 1 cup walnuts.",
      "Whisk flour, baking soda, salt, and cinnamon in a medium bowl until very well blended.",
      "In a separate bowl, whisk the oil, granulated sugar, brown sugar, and vanilla.",
      "Add the eggs, one at a time, whisking after each one.",
      "Switch to a large rubber spatula. Scrape the sides and bottom of the bowl, then add the dry ingredients in three parts, gently stirring until they disappear and the batter is smooth.",
      "Stir in the carrots, nuts, and raisins.",
      "Divide the cake batter between the prepared cake pans. Bake until the tops of the cake layers are springy when touched and when a toothpick inserted into the center of the cake comes out clean, 35 to 45 minutes.",
      "Cool the cakes in the pans for 15 minutes, then carefully turn the cake layers out onto cooling racks.",
      "Remove the parchment paper and cool completely. If you find that a cake layer is sticking to the bottom of the pan, leave the cake pan upside down and allow gravity to do its thing.",
      "Your cake is done. Enjoy!"
    ]
  },
  {
    "name": "Butter Cake",
    "ingredients": ["flour", "baking powder", "salt", "sugar", "butter", "eggs", "vanilla extract", "milk"],
    "steps": [
      "To make a butter cake, you need 1 ½ cups flour, 1 tsp baking powder, 1 cup sugar, 1 cup butter, 4 eggs, 1 teaspoon vanilla extract.",
      "Sift flour, baking powder, and salt together in a large bowl.",
      "Beat sugar and butter together in a large bowl with an electric mixer until light and fluffy.",
      "Add eggs one at a time, beating well after each addition. Beat in vanilla extract.",
      "Add flour mixture in 1/2 cup batches, alternating with milk, beating batter briefly after each addition until just blended.",
      "Pour batter into the prepared pan.",
      "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes.",
      "Let cool in the pan for 10 minutes before inverting onto a wire rack to cool completely.",
      "Your cake is done. Enjoy!"
    ]
  },
  {
    "name": "Red Velvet Cake",
    "ingredients": ["flour", "baking soda", "butter", "cocoa powder", "buttermilk", "red food coloring", "cream cheese", "sugar"],
    "steps": [
      "To make a red velvet cake, you need 2 cups of flour, 1 teaspoon baking soda, ⅔ cup butter, ¼ cup cocoa powder, 1 cup buttermilk, 2 teaspoon red food coloring, 340 grams cream cheese, and 1 ½ cups sugar.",
      "In a medium bowl, sift the flour, salt, and baking soda together.",
      "Cream the butter on medium speed in the bowl of a stand mixer fitted with a paddle attachment. Add in sugar and mix on medium until light and fluffy. Add the eggs in one at a time, beating each until well combined.",
      "Beat in the vanilla, then sift the cocoa powder into the butter mixture. Beat just until combined. Scrape down the bowl.",
      "In a liquid measuring cup, combine the buttermilk, and red food coloring. (The more you use, the brighter the color when baked.)",
      "With the mixer on low speed, add half of the flour mixture followed by half of the buttermilk mixture to the mixing bowl, beating just until combined. Repeat with the remaining flour and buttermilk. Stop and scrape down the bowl occasionally.",
      "Divide the batter among three buttered 6-inch pans and bake for about 30 to 35 minutes or until the centers are springy to the touch.",
      "To make the cream cheese frosting, beat the butter, cream cheese, vanilla, and salt together until smooth and fluffy. Gradually add the sifted powdered sugar to the mixer and continue mixing until incorporated. Set aside a cup.",
      "Place a cake layer on the cake stand and evenly spread ½ cup of frosting on top. Continue with the rest of the layers, then use the remaining frosting to coat the outside of the cake.",
      "Your cake is done. Enjoy!"
    ]
  },
  {
    "name": "Brownies",
    "ingredients": ["sugar", "flour", "cocoa powder", "chocolate", "salt", "eggs", "oil", "water", "vanilla extract"],
    "steps": [
      "To make brownies, you need 1 and 1/2 cups granulated sugar, 3/4 cup all-purpose flour, 2/3 cup cocoa powder, sifted if lumpy, 1/2 cup powdered sugar, sifted if lumpy, 1/2 cup dark chocolate chips, 3/4 teaspoons sea salt, 2 large eggs, 1/2 cup canola oil or extra-virgin olive oil, 2 tablespoons water, and 1/2 teaspoon vanilla.",
      "Preheat the oven to 325°F or 163°C. Lightly spray an 8x8 baking dish (not a 9x9 dish or your brownies will overcook) with cooking spray and line it with parchment paper. Spray the parchment paper.",
      "In a medium bowl, combine the sugar, flour, cocoa powder, powdered sugar, chocolate chips, and salt.",
      "In a large bowl, whisk together the eggs, olive oil, water, and vanilla.",
      "Sprinkle the dry mix over the wet mix and stir until just combined.",
      "Pour the batter into the prepared pan (it'll be thick - that's ok) and use a spatula to smooth the top.",
      "Bake for 40 to 48 minutes, or until a toothpick comes out with only a few crumbs attached (note: it's better to pull the brownies out early than to leave them in too long).",
      "Cool completely before slicing.",
      "Store in an airtight container at room temperature for up to 3 days. These also freeze well!"
    ]
  },
  {
    "name": "Lemon Cookies",
    "ingredients": ["flour", "butter", "sugar", "eggs", "lemon", "baking powder"],
    "steps": [
      "To make lemon cookies, you need 1 ½ cups of all purpose flour, ½ cup butter, ½ cup sugar, 1 egg, 1 lemon, and ½ tsp baking powder.",
      "Preheat oven to 175°C or 350°F. Line a baking tray with parchment paper.",
      "Zest the lemon using a fine grater or zester. Grate only the yellow part (about 1 tsp);. Juice the lemon by cutting it in half and squeezing it (using your hands or a citrus squeezer). You'll need about 1 tablespoon of juice.",
      "In a mixing bowl, cream the softened butter and sugar together until light and fluffy (about 2–3 minutes).",
      "Add the egg, lemon zest, and 1 tablespoon of lemon juice to the mixture. Mix until fully combined.",
      "In a separate bowl, sift together the flour and baking powder.",
      "Gradually mix the dry ingredients into the wet mixture, stirring until a soft dough forms.",
      "Scoop out small amounts of dough, roll into balls, and place on the tray. Gently flatten each ball with your fingers or the back of a spoon.",
      "Bake for 10–12 minutes, or until the edges are just turning golden. Do not overbake.",
      "Let cookies cool on the tray for 5 minutes, then transfer to a wire rack to cool completely."
    ]
  },
  {
    "name": "Walnut Cake",
    "ingredients": ["butter", "sugar", "brown sugar", "eggs", "flour", "walnuts", "baking powder", "salt", "cinnamon", "coffee", "milk"],
    "steps": [
      "To make a walnut cake, you need 220 grams butter soft, 70 grams sugar, 100 grams brown sugar, 4 eggs medium, 150 grams all-purpose flour, 200 grams ground walnuts, 2 teaspoons baking powder, 1 pinch salt, ½ teaspoon cinnamon, 3 tablespoons cooled coffee or milk, and walnut kernels for decoration.",
      "Preheat the oven to 350°F or 175°C.",
      "Grease the springform pan and dust it with flour.",
      "Make a small cup of coffee.",
      "Cream the soft butter with the sugar. Gradually stir in the eggs, one at a time.",
      "Mix flour with nuts, cinnamon, salt, and baking powder. Stir in alternately with the cooled coffee or milk. Use enough liquid until the dough falls from the spoon with difficulty tearing.",
      "Pour the dough into the prepared pan, smooth it out, top with walnut halves if desired.",
      "Bake for 25-30 minutes. Test with chopsticks.",
      "Your cake is done. Enjoy!"
    ]
  }
]
